{
  "Layout": {
    "contact": "Contact Me",
    "description": "Dialog for contact",
    "close": "Close",
    "Form": {
      "contact": "Write to Me",
      "name": "Name",
      "email": "Email",
      "message": "Message",
      "submit": "Send",
      "headerTitle": "Want to talk to me?"
    }
  },
  "HomePage": {
    "title": "Rodrigo Vildosola",
    "subtitle": "Software Engineer",
    "description1": "Full-Stack Web development and Software Design",
    "description2": "Skilled in Machine Learning, cybersecurity, and data analysis. Proactive, adaptable, and motivated team player.",
    "viewWork": "View My Work",
    "aboutMe": {
      "title": "About Me",
      "content1": "I am a future Civil Engineer in Computer Science with nearly a year of experience in software development and web technologies. I have skills in Machine Learning, cybersecurity, and data analysis. I am proactive, adaptable, and highly motivated by my work, with a notable ability to work in teams. Currently, I am looking for opportunities in a dynamic environment that promotes professional growth and technological innovation.",
      "content2": "Outside of coding, I enjoy reading about new tech trends, going to the gym, spending time with family, going out with friends, and playing games."
    },
    "Experience": {
      "title": "Experience",
      "contact": "Contact",
      "items": [
        {
          "company": "Higher Bit Solutions (HBS)",
          "role": "Full-Stack Developer",
          "duration": "July 2023 - May 2024",
          "description": "Worked as a Full-Stack Developer on web applications, APIs, databases, and Machine Learning.",
          "contact": "pgrand@hbsolutions.cl",
          "image": "hbsLogo"
        }
      ]
    },
    "Education": {
      "title": "Education",
      "items": [
        {
          "institution": "Universidad De los Andes",
          "subheader": "Software Engineering",
          "description": "Studying Software Engineering with a focus on web development, data analysis, and machine learning.",
          "image": "uandes",
          "duration": "2020 - 2025"
        },
        {
          "institution": "Colegio del Verbo Divino",
          "description": "Graduated with a focus on science and mathematics. Active in various extracurricular activities.",
          "image": "cvd",
          "duration": "2005 - 2019"
        }
      ]
    },
    "Skills": {
      "title": "Skills",
      "openLabel": " more",
      "closeLabel": " less",
      "see":"Show",
      "Languages": "Languages",
      "Frameworks": "Frameworks",
      "Tools and Databases": "Tools and Databases",
      "Development Concepts": "Development Concepts",
      "pythonDescription": "Proficient in Python for web development, data analysis, and scripting tasks.",
      "javascriptDescription": "Experienced in JavaScript for both front-end and back-end programming.",
      "reactDescription": "Adept at building dynamic user interfaces with React.",
      "nextjsDescription": "Knowledgeable in creating server-rendered applications using Next.js.",
      "rorDescription": "Skilled in developing full-stack web applications with Ruby on Rails.",
      "djangoDescription": "Capable of building robust web applications using Django.",
      "flaskDescription": "Proficient in crafting lightweight web applications with Flask.",
      "cDescription": "Experienced in system programming and low-level applications with C.",
      "cppDescription": "Proficient in object-oriented programming and system applications with C++.",
      "csharpDescription": "Skilled in developing Windows applications and games with C#.",
      "sqlDescription": "Experienced in SQL database management and querying.",
      "nodeDescription": "Competent in server-side JavaScript development with Node.js.",
      "gitDescription": "Proficient in version control and collaborative development using Git.",
      "dockerDescription": "Experienced with containerization and deployment using Docker.",
      "awsDescription": "Skilled in leveraging AWS for cloud computing and infrastructure management.",
      "postgresqlDescription": "Proficient in managing and querying PostgreSQL databases.",
      "mongodbDescription": "Competent in handling NoSQL databases with MongoDB.",
      "mysqlDescription": "Skilled in managing MySQL databases for various applications.",
      "tensorflowDescription": "Knowledgeable in machine learning and deep learning with TensorFlow.",
      "kerasDescription": "Capable of building and training neural networks using Keras.",
      "pandasDescription": "Proficient in data manipulation and analysis with Pandas.",
      "numpyDescription": "Experienced in numerical computing and data processing with NumPy.",
      "unitTestingDescription": "Skilled in writing unit tests to ensure code quality and reliability.",
      "restfulApiDescription": "Experienced in developing RESTful APIs for web services."    
    },
    "Social": {
      "title": "Find me on"
    }
  },
  "ProjectsPage": {
    "title": "Projects",
    "description": "Some of the projects I have worked on.",
    "openLabel": "Show Details",
    "closeLabel": "Hide Details",
    "viewProject": "View Project"
  },
  "ContactPage": {
    "title": "Contact Me",
    "description": "I'd love to hear from you! Whether you have a question about my work, want to discuss a project, or just want to say hi, feel free to get in touch.",
    "moreInfo": "Here are some ways you can reach out to me:",
    "formTitle": "Write to Me",
    "reachOut": "Reach Out to Me",
    "emailLabel": "Email"
  },
  "ResumePage": {
    "title": "My Resume",
    "description": "Below is my professional resume. You can view it directly or download it.",
    "download": "Download Resume"
  },
  "Navbar": {
    "Home": "Home",
    "Projects": "Projects",
    "Contact": "Contact",
    "Resume": "Resume",
    "Language": "Language",
    "English": "English",
    "Spanish": "Spanish",
    "Light Mode": "Light",
    "Dark Mode": "Dark"
  },
  "Footer": {
    "rights": "All rights reserved."
  }
}
