{
  "Layout": {
    "contact": "Hablame",
    "description": "Dialogo para contacto",
    "close": "Cerrar",
    "Form": {
      "contact": "Escribeme aca",
      "name": "Nombre",
      "email": "Correo electrónico",
      "message": "Mensaje",
      "submit": "Enviar",
      "headerTitle": "¿Quieres hablar conmigo?"
    }
  },
  "HomePage": {
    "title": "Rodrigo Vildosola",
    "subtitle": "Software Engineer",
    "description1": "Desarrollo Full-Stack Web y Diseño de Software",
    "description2": "Habilidades en Machine Learning, ciberseguridad y análisis de datos. Proactivo, adaptable y motivado para trabajar en equipo.",
    "viewWork": "Ver Mi Trabajo",
    "aboutMe": {
      "title": "Sobre Mí",
      "content1": "Soy un futuro Ingeniero Civil en Computación con casi un año de experiencia en desarrollo de software y tecnologías web. Tengo habilidades en Machine Learning, ciberseguridad y análisis de datos. Soy proactivo, adaptable y altamente motivado por mi trabajo, con una notable capacidad para trabajar en equipo. Actualmente, busco oportunidades en un entorno dinámico que promueva el crecimiento profesional y la innovación tecnológica.",
      "content2": "Fuera de la programación, disfruto leer sobre nuevas tendencias tecnológicas, ir al gimnasio, pasar tiempo con la familia, salir con amigos y jugar videojuegos."
    },
    "Experience": {
      "title": "Experiencia",
      "contact": "Contacto",
      "items": [
        {
          "company": "Higher Bit Solutions (HBS)",
          "role": "Desarrollador Full-Stack",
          "duration": "Julio 2023 - Mayo 2024",
          "description": "Trabajé como desarrollador Full-Stack en aplicaciones web, APIs, bases de datos y Machine Learning.",
          "contact": "pgrand@hbsolutions.cl",
          "image": "hbsLogo"
        }
      ]
    },
    "Education": {
      "title": "Educación",
      "items": [
        {
          "institution": "Universidad De los Andes",
          "subheader": "Ingeniería de Software",
          "description": "Estudiando Ingeniería de Software con un enfoque en desarrollo web, análisis de datos y aprendizaje automático.",
          "image": "uandes",
          "duration": "2020 - 2025"
        },
        {
          "institution": "Colegio del Verbo Divino",
          "description": "Graduado con un enfoque en ciencias y matemáticas. Activo en varias actividades extracurriculares.",
          "image": "cvd",
          "duration": "2005 - 2019"
        }
      ]
    },
    "Skills": {
      "title": "Habilidades",
      "openLabel": " mas",
      "closeLabel": " menos",
      "see":"Ver ",
      "Languages": "Lenguajes",
      "Frameworks": "Frameworks",
      "Tools and Databases": "Herramientas y Bases de Datos",
      "Development Concepts": "Conceptos de Desarrollo",
      "pythonDescription": "Proficiente en Python para desarrollo web, análisis de datos y tareas de scripting.",
      "javascriptDescription": "Experimentado en JavaScript tanto para programación front-end como back-end.",
      "reactDescription": "Capaz de construir interfaces de usuario dinámicas con React.",
      "nextjsDescription": "Conocimientos en la creación de aplicaciones renderizadas en el servidor usando Next.js.",
      "rorDescription": "Hábil en el desarrollo de aplicaciones web full-stack con Ruby on Rails.",
      "djangoDescription": "Capaz de construir aplicaciones web robustas usando Django.",
      "flaskDescription": "Proficiente en la creación de aplicaciones web ligeras con Flask.",
      "cDescription": "Experimentado en programación de sistemas y aplicaciones de bajo nivel con C.",
      "cppDescription": "Proficiente en programación orientada a objetos y aplicaciones de sistema con C++.",
      "csharpDescription": "Hábil en el desarrollo de aplicaciones y juegos para Windows con C#.",
      "sqlDescription": "Experimentado en la gestión y consulta de bases de datos SQL.",
      "nodeDescription": "Competente en desarrollo de JavaScript del lado del servidor con Node.js.",
      "gitDescription": "Proficiente en control de versiones y desarrollo colaborativo usando Git.",
      "dockerDescription": "Experimentado con la contenedorización y despliegue usando Docker.",
      "awsDescription": "Hábil en aprovechar AWS para computación en la nube y gestión de infraestructura.",
      "postgresqlDescription": "Proficiente en la gestión y consulta de bases de datos PostgreSQL.",
      "mongodbDescription": "Competente en el manejo de bases de datos NoSQL con MongoDB.",
      "mysqlDescription": "Hábil en la gestión de bases de datos MySQL para varias aplicaciones.",
      "tensorflowDescription": "Conocimientos en aprendizaje automático y profundo con TensorFlow.",
      "kerasDescription": "Capaz de construir y entrenar redes neuronales usando Keras.",
      "pandasDescription": "Proficiente en manipulación y análisis de datos con Pandas.",
      "numpyDescription": "Experimentado en computación numérica y procesamiento de datos con NumPy.",
      "unitTestingDescription": "Hábil en escribir pruebas unitarias para asegurar la calidad y confiabilidad del código.",
      "restfulApiDescription": "Experimentado en el desarrollo de APIs RESTful para servicios web."
    },
    "Social": {
      "title": "Encuentrame en"
    }
  },
  "ProjectsPage": {
    "title": "Proyectos",
    "description": "Algunos de los proyectos que he realizado",
    "openLabel": "Mostrar Detalles",
    "closeLabel": "Ocultar Detalles",
    "viewProject": "Ver Proyecto"
  },
  "ContactPage": {
    "title": "Contáctame",
    "description": "¡Me encantaría saber de ti! Ya sea que tengas una pregunta sobre mi trabajo, quieras discutir un proyecto o simplemente quieras saludar, no dudes en ponerte en contacto.",
    "moreInfo": "Aquí hay algunas formas de comunicarte conmigo:",
    "formTitle": "Escríbeme",
    "reachOut": "Ponte en contacto conmigo",
    "emailLabel": "Correo electrónico"
  },
  "ResumePage": {
    "title": "Mi Currículum",
    "description": "A continuación se muestra mi currículum profesional. Puedes verlo directamente o descargarlo.",
    "download": "Descargar Currículum"
  },
  "Navbar": {
    "Home": "Inicio",
    "Projects": "Proyectos",
    "Contact": "Contacto",
    "Resume": "Currículum",
    "Language": "Idioma",
    "English": "Inglés",
    "Spanish": "Español",
    "Light Mode": "Claro",
    "Dark Mode": "Oscuro"
  },
  "Footer": {
    "rights": "Todos los derechos reservados."
  }
}
