{
  "Layout": {
    "contact": "Hablame",
    "description": "Dialogo para contacto",
    "Form": {
      "contact": "Escribeme aca",
      "name": "Nombre",
      "email": "Correo electrónico",
      "message": "Mensaje",
      "submit": "Enviar",
      "headerTitle": "¿Quieres hablar conmigo?"
    }
  },
  "HomePage": {
    "title": "Rodrigo Vildosola",
    "description1": "Futuro Ingeniero Civil en Computación con experiencia en desarrollo de software y tecnologías web.",
    "description2": "Habilidades en Machine Learning, ciberseguridad y análisis de datos. Proactivo, adaptable y motivado para trabajar en equipo.",
    "viewWork": "Ver Mi Trabajo",
    "aboutMe": {
      "title": "Sobre Mí",
      "content1": "Soy un futuro Ingeniero Civil en Computación con casi un año de experiencia en desarrollo de software y tecnologías web. Tengo habilidades en Machine Learning, ciberseguridad y análisis de datos. Soy proactivo, adaptable y altamente motivado por mi trabajo, con una notable capacidad para trabajar en equipo. Actualmente, busco oportunidades en un entorno dinámico que promueva el crecimiento profesional y la innovación tecnológica.",
      "content2": "Fuera de la programación, disfruto leer sobre nuevas tendencias tecnológicas, ir al gimnasio, pasar tiempo con la familia, salir con amigos y jugar videojuegos."
    },
    "Experience": {
      "title": "Experiencia",
      "contact": "Contacto",
      "items": [
        {
          "company": "Higher Bit Solutions (HBS)",
          "role": "Desarrollador Full-Stack",
          "duration": "Julio 2023 - Mayo 2024",
          "description": "Trabajé como desarrollador Full-Stack en aplicaciones web, APIs, bases de datos y Machine Learning.",
          "contact": "pgrand@hbsolutions.cl",
          "image": "hbsLogo"
        }
      ]
    },
    "Education": {
      "title": "Educación",
      "items": [
        {
          "institution": "Universidad De los Andes",
          "subheader": "Ingeniería de Software",
          "description": "Estudiando Ingeniería de Software con un enfoque en desarrollo web, análisis de datos y aprendizaje automático.",
          "image": "uandes",
          "duration": "2020 - 2025"
        },
        {
          "institution": "Colegio del Verbo Divino",
          "description": "Graduado con un enfoque en ciencias y matemáticas. Activo en varias actividades extracurriculares.",
          "image": "cvd",
          "duration": "2005 - 2019"
        }
      ]
    },
    "Skills": {
      "title": "Habilidades",
      "openLabel": " mas",
      "closeLabel": " menos",
      "see":"Ver ",
      "Languages": "Lenguajes",
      "Frameworks": "Frameworks",
      "Tools and Databases": "Herramientas y Bases de Datos",
      "Development Concepts": "Conceptos de Desarrollo",
      "pythonDescription": "Experiencia con Python para desarrollo web, análisis de datos y scripting.",
      "javascriptDescription": "Competente en JavaScript tanto para desarrollo front-end como back-end.",
      "reactDescription": "Habilidad en el uso de React para construir interfaces de usuario dinámicas.",
      "nextjsDescription": "Experiencia en la construcción de aplicaciones renderizadas por servidor utilizando Next.js.",
      "rorDescription": "Experiencia con Ruby on Rails para construir aplicaciones web full-stack.",
      "djangoDescription": "Habilidad en el uso de Django para crear aplicaciones web robustas.",
      "flaskDescription": "Competente en el uso de Flask para aplicaciones web ligeras.",
      "cDescription": "Experiencia en el uso de C para programación de sistemas y aplicaciones de bajo nivel.",
      "cppDescription": "Competente en el uso de C++ para programación orientada a objetos y aplicaciones de sistemas.",
      "csharpDescription": "Experiencia en el uso de C# para construir aplicaciones de Windows y juegos.",
      "sqlDescription": "Experienced",
      "nodeDescription": "Habilidad en el uso de Node.js para aplicaciones JavaScript del lado del servidor.",
      "gitDescription": "Competente en el uso de Git para control de versiones y desarrollo colaborativo.",
      "dockerDescription": "Experiencia con Docker para la contenedorización y despliegue.",
      "awsDescription": "Habilidad en el uso de AWS para servicios de infraestructura y computación en la nube.",
      "postgresqlDescription": "Competente en la gestión y consulta de bases de datos PostgreSQL.",
      "mongodbDescription": "Experiencia en el uso de MongoDB para la gestión de bases de datos NoSQL.",
      "mysqlDescription": "Habilidad en la gestión de bases de datos MySQL para diversas aplicaciones.",
      "tensorflowDescription": "Experiencia en el uso de TensorFlow para aprendizaje automático y aprendizaje profundo.",
      "kerasDescription": "Habilidad en el uso de Keras para construir y entrenar redes neuronales.",
      "pandasDescription": "Competente en el uso de Pandas para manipulación y análisis de datos.",
      "numpyDescription": "Experiencia en el uso de NumPy para computación numérica y procesamiento de datos.",
      "unitTestingDescription": "Habilidad en la escritura de pruebas unitarias para garantizar la calidad y fiabilidad del código.",
      "restfulApiDescription": "Experiencia en el desarrollo de API RESTful para servicios web."
    },
    "Social": {
      "title": "Encuentrame en"
    }
  },
  "ProjectsPage": {
    "title": "Proyectos",
    "description": "Algunos de los proyectos que he realizado",
    "openLabel": "Mostrar Detalles",
    "closeLabel": "Ocultar Detalles",
    "viewProject": "Ver Proyecto"
  },
  "ContactPage": {
    "title": "Contáctame",
    "description": "¡Me encantaría saber de ti! Ya sea que tengas una pregunta sobre mi trabajo, quieras discutir un proyecto o simplemente quieras saludar, no dudes en ponerte en contacto.",
    "moreInfo": "Aquí hay algunas formas de comunicarte conmigo:",
    "formTitle": "Escríbeme",
    "reachOut": "Ponte en contacto conmigo",
    "emailLabel": "Correo electrónico"
  },
  "ResumePage": {
    "title": "Mi Currículum",
    "description": "A continuación se muestra mi currículum profesional. Puedes verlo directamente o descargarlo.",
    "download": "Descargar Currículum"
  },
  "Navbar": {
    "Home": "Inicio",
    "Projects": "Proyectos",
    "Contact": "Contacto",
    "Resume": "Currículum",
    "Language": "Idioma",
    "English": "Inglés",
    "Spanish": "Español",
    "Light Mode": "Claro",
    "Dark Mode": "Oscuro"
  },
  "Footer": {
    "rights": "Todos los derechos reservados."
  }
}
